---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDetails
source: html/fd1b0cff-3a22-870d-c22b-6275df02afdb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDetails Property

Can't copy some or all of the detailing with the view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyDetails { get; }
```